# SectionCoarserScalePulldownImperial Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SectionCoarserScalePulldownImperial Property
ParameterTypeId Class See Also
---
"Hide at scales coarser than"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SectionCoarserScalePulldownImperial { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SectionCoarserScalePulldownImperial As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SectionCoarserScalePulldownImperial {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace